"""
Задание 1.

Каждое из слов «разработка», «сокет», «декоратор» представить
в буквенном формате и проверить тип и содержание соответствующих переменных.
Затем с помощью онлайн-конвертера преобразовать
в набор кодовых точек Unicode (НО НЕ В БАЙТЫ!!!)
и также проверить тип и содержимое переменных.

Подсказки:
--- 'разработка' - буквенный формат
--- '\u0440\u0430\u0437\u0440\u0430\u0431\u043e\u0442\u043a\u0430' - набор кодовых точек
--- используйте списки и циклы, не дублируйте функции

"""

a = 'разработка'
b = 'сокет'
c = 'декоратор'

print(type(a), a, '\n')
print(type(b), b, '\n')
print(type(c), c, '\n' * 2, '–' * 100)

a_unicode = '\u0440\u0430\u0437\u0440\u0430\u0431\u043e\u0442\u043a\u0430'
b_unicode = '\u0441\u043e\u043a\u0435\u0442'
c_unicode = '\u0434\u0435\u043a\u043e\u0440\u0430\u0442\u043e\u0440'

print(type(a_unicode), a_unicode, '\n')
print(type(b_unicode), b_unicode, '\n')
print(type(c_unicode), c_unicode, '\n' * 2, '–' * 100)

print(a == a_unicode, '\n')
print(b == b_unicode, '\n')
print(c == c_unicode, '\n')
